import React from 'react';
import UsersList from './users/UsersList.jsx';
import { Provider } from 'react-redux';
import store from './store.js';

const App = () => {
  return (
    <Provider store={store}>
      <UsersList />
    </Provider>
  );
};

export default App;

/*
з чого складається стор? зі масиву з юзерами, тобто зі списку
екшени це перемикачі списку з якого складається стор
реддьюсер перемикає список і записує в стейт на скільки сторінок треба переключитись
формуємо стор з редьюсера
конектимо стор в компоненту юсерліст
замість функцій, які перемикають список діспатчемо екшени які перемикають список 
в стейті знаходиться сторінка де ми знаходимось і список (масив)

провайдесо стор в апп
за ешени беремо перемикачі списку
початковий стейт в нас масив і нульова сторінка
нам треба щоб відображало по три користувачі на сторінці 
  тому в стор який попаде в стейт компоненти треба передати масив і номер сторінки, щоб могти відображати по 3 користувачі на сторінці
в редьюсер попадають екшени і формують стор
стор конектимо до компоненти
в функції діспатч є пропси компоненти (тобто екшени) які переключають сторінку
у функції мапстейт знаходиться стейт (масив і переключена сторінка)
замінюємо потрібні дані в компоненти на дані зі стейту
*/
